from core.commands import komut_calistir
from core.parser import komutlari_ayir


print(r"""
=========================================

        █████╗ ██████╗  ██████╗ ██╗   ██╗███████╗
       ██╔══██╗██╔══██╗██╔════╝ ██║   ██║██╔════╝
       ███████║██████╔╝██║  ███╗██║   ██║███████╗
       ██╔══██║██╔══██╗██║   ██║██║   ██║╚════██║
       ██║  ██║██║  ██║╚██████╔╝╚██████╔╝███████║
       ╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝  ╚═════╝ ╚══════╝


              A R G U S  v0.4.0

        Advanced Response & Guidance
             Utility System

=========================================

Sistem hazır.
""")



print("========== ARGUS v0.3 ==========")
print("Yazılı mod aktif.")
print("Çıkmak için 'çık' yaz.\n")


while True:
    komut = input("Sen > ").strip()

    if not komut:
        continue

    if komut.lower() == "çık":
        print("ARGUS > Görüşmek üzere.")
        break

    komutlar = komutlari_ayir(komut)

    for k in komutlar:
        cevap = komut_calistir(k)

        if cevap:
            print(f"ARGUS > {cevap}")
        else:
            print(f"ARGUS > '{k}' komutunu anlayamadım.")